import React from 'react';
import AboutPhoto from "../images/set-bins-types-garbage-classification-illustration_667511-844.avif";
import { Col, Image, Row } from "antd";
import "../styles/About.css";

const About = () => {
    return (
        <>
            <Row align={"middle"} style={{ marginTop: "100px" }}>
                <Col span={24} style={{ textAlign: "center" }}>
                    <div className="about-large-font">Про нас</div>
                </Col>
            </Row>
            <Row className="about" align={"middle"} style={{ marginTop: "20px" }}>
                <Col offset={1} sm={22} lg={11}>
                    <Image src={AboutPhoto}></Image>
                </Col>
                <Col sm={22} lg={11}>
                    <div className="about-medium-font">
                        Сміттєві баки “SmartSort” – це інноваційна система управління відходами, призначенням якої є створення максимально комфортних умов для їх користувачів шляхом впровадження ІоТ.

                        Принцип роботи баків заключається в зчитуванні даних з різноманітних датчиків та передача цих даних користувачу через веб-застосунок.

                        “SmartSort” система пропонує користувачам основні шість категорій сміттєвих баків за типом відходів що є інтуїтивно зрозумілим та простим при прийнятті рішення до якого типу відходів належить той чи інший предмет.

                        Скло, пластик, папір, метал, електичні відходи – саме ці категорії відходів є основними в статистиці по забрудненню навколишнього середовища та впливу на здоров’я людей, адже розкладання побутових відходів може займати від кількох тижнів і до декількох сотень років, що несе за собою також викид небезпечних речовин в навколишній простір.
                        Для розуміння розглянемо декілька прикладів наведених нижче.

                        <ul>
                            <li>Скляна пляшка  ~ 1000 років;</li>
                            <li>Пластикова пляшка ~ 450 років;</li>
                            <li>Алюмінієва банка  ~ 200 років;</li>
                            <li>Батарейка ~ 100 років;</li>
                            <li>Поліетиленовий пакет ~ від 10 до 20 років;</li>
                            <li>Книга ~ 2 роки;</li>
                            <li>Газета ~ до 6 тижнів.</li>
                        </ul>

                        Це лише кілька прикладів із декількох категорій сміття, проте, уявімо скільки таких відходів створюється людством щодня, та скільки часу займає їх розкладання. Саме тому ефективним стане рішення застосовувати сміттєві баки “SmartSort”  для утилізації посортованих відходів, які буде перероблено і в результаті отримано безліч переваг для людства, екології, атмосфери, грунту.
                    </div>
                </Col>
            </Row>
        </>
    );
};

export default About;
